# GetParentModelName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LinkLoadResult..::..GetParentModelName Method
LinkLoadResult Class See Also
---
Returns the name of the parent of the linked model, or an empty FilePath if the link is a top-level link.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ModelPath GetParentModelName()
```

Visual Basic
---
```text
Public Function GetParentModelName As ModelPath
```

Visual C++
---
```text
public:
ModelPath^ GetParentModelName()
```

# Remarks
This function is only relevant for LinkLoadResult object for RvtLinkSymbol. ie. when getIsRvtLink() is true.
# See Also
LinkLoadResult Class
Autodesk.Revit.DB Namespace